{
  "header": {
    "email": "E-Mail",
    "linkedin": "LinkedIn",
    "github": "GitHub",
    "lang_de": "DE",
    "lang_en": "EN"
  },
  "legal": {
    "title": "Legal Notice",
    "imprint": "Imprint",
    "names_list": "Ebubekir Elicora",
    "address": "Kolberger Str.4",
    "postcode_city": "44649 Herne",
    "exploring": "Exploring the Board",
    "email_label": "ebubekir.elicora@gmx.de",
    "acceptance": "Acceptance of terms",
    "acceptance_text": "By accessing and using Portfolio, you acknowledge and agree to the following terms and conditions, and any policies or amendments that may be presented to you from time to time. We, the listed students, may update or change the terms and conditions without notice.",
    "scope": "Scope and ownership of the product",
    "scope_text_1": "Portfolio was developed as part of a student group project in a web development bootcamp at Developer Akademie GmbH. It serves educational purposes and is not intended for extensive personal or business use. Therefore, we cannot guarantee consistent availability, reliability, or accuracy.",
    "scope_text_2": "The design of Portfolio is owned by Developer Akademie GmbH. Unauthorized use, reproduction, modification, distribution, or replication of the design is strictly prohibited.",
    "proprietary": "Proprietary rights",
    "proprietary_text": "Aside from the design owned by Developer Akademie GmbH, we, the listed students, retain all proprietary rights in Portfolio, including any associated copyrighted material, trademarks, and other proprietary information.",
    "use_of_product": "Use of the product",
    "use_of_product_text": "Portfolio is to be used for lawful purposes only, in accordance with all applicable laws and regulations. Any use to exploit, advertise, harass, harm, threaten, or infringe the rights of others is strictly prohibited. You are solely responsible for your interactions with other users of Portfolio.",
    "disclaimer": "Disclaimer of warranties & limitation of liability",
    "disclaimer_text": "Portfolio is provided “as is” without any warranty of any kind, whether express or implied, including but not limited to the implied warranties of merchantability, fitness for a particular purpose, and non-infringement. In no event shall we, the listed students, or Developer Akademie GmbH be liable for any direct or indirect damages to the extent permitted by law.",
    "indemnity": "Indemnity",
    "indemnity_text": "You agree to indemnify, defend, and hold harmless us, the listed students, Developer Akademie GmbH, and our affiliates and employees from any claims arising out of your use of Portfolio or your breach of this Legal Notice.",
    "contact_line": "For any questions or notices, please contact us at ebubekir.elicora@gmx.de.",
    "date": "Date: {{date}}",
    "footer_legal": "Legal notice",
    "footer_privacy": "Privacy policy"
  },
  "nav": {
    "brand_arc": "full-stack developer",
    "brand_about_aria": "Go to the start/about section",
    "why_me": "Why me",
    "skills": "Skills",
    "skills_mobile": "My Skill Set",
    "my_work": "My Work",
    "contact": "Contact",
    "contact_mobile": "Contact me"
  },
  "why": {
    "headline": "Why me",
    "intro": "I enjoy working in IT because clearly structured problems and well-thought-out solutions have always attracted me. Programming gives me the opportunity to implement ideas precisely while staying creative at the same time. What drives me is the desire to become a little better every day, not out of obligation, but out of genuine curiosity. New technologies, clean code patterns and well-executed projects by other developers inspire me to keep sharpening my own skills. It matters to me to work reliably, to truly understand things and to take responsibility for the outcome. I don’t just want to write code, but contribute to making projects stable, understandable and maintainable in the long run.",
    "title": "I am:",
    "located": "Located in Herne",
    "remote": "Open to work remote",
    "relocate": "Open to relocate",
    "contact_btn": "Contact me"
  },
  "skills": {
    "headline": "My Skill Set",
    "intro": "I have worked on different projects where I used modern frontend technologies such as Angular, TypeScript, JavaScript, HTML and CSS. Through these diverse experiences, I learned to develop in a structured, clean and solution-oriented way. At the same time, I also took on backend tasks in several projects, including Python, Django, Flask, SQL and Firebase, which helps me understand applications as a whole. New technologies motivate me, and I adopt them quickly and openly in order to continuously expand my skills and adapt flexibly to new requirements."
  },
  "work": {
    "mobile": {
      "intro": "I love developing myself further and trying out new technologies directly in practice. If I can improve something, I do it without detours. Innovation is not a buzzword for me, but the way I work: finding solutions that are smarter, faster and more stable. I keep myself technically up to date at all times, because standing still is not an option for me."
    },
    "headline": "My Work",
    "toggle": {
      "more": "Show me more",
      "less": "Show me less"
    },
    "skills": {
      "challangeMe": "Challenge me!"
    },

    "project1": {
      "title": "Project Join",
      "about": "About the project",
      "about_text": "Task manager inspired by the Kanban System. Create and organize tasks using drag and drop functions, assign users and categories.",
      "tech": "Technologies I have used",
      "tech_list": "Angular, TypeScript, HTML, CSS, Firebase",
      "team": "My team work experience",
      "team_text": "Working on Join in a team environment taught me how to collaborate efficiently in a real development workflow. We split responsibilities for features like drag-and-drop tasks, user assignment and the Kanban board logic, which required clean communication and aligned structure. Through regular Git commits, pull requests and code reviews I learned how to keep a shared TypeScript codebase maintainable. The project strengthened my ability to solve merge conflicts, organize reusable components and write logic that stays understandable for the whole team. It gave me hands-on experience with professional teamwork, shared ownership and building features that integrate smoothly with others."
    },

    "project2": {
      "title": "Project Pollo Loco",
      "about": "About the project",
      "about_text": "Jump, run and throw game based on object-oriented approach. Help Pepe to find coins and tabasco salsa to fight against the crazy hen.",
      "tech": "Technologies I have used",
      "tech_list": "JavaScript, HTML, CSS",
      "learned": "What I have learned",
      "learned_text": "Working on El Pollo Loco helped me grow far beyond basic JavaScript skills. I built a complete game architecture from scratch, using object-oriented programming, class-based modules and a structured update cycle. I learned how to design clean components, separate responsibilities clearly and keep the game loop stable even as the project became more complex. This project strengthened my ability to think in systems, write maintainable code and turn ideas into a fully working digital product, skills I can apply directly in real development teams."
    },

    "project3": {
      "title": "Project Ring of Fire",
      "about": "About the project",
      "about_text": "Digital implementation of the popular party card game Ring of Fire. Players draw cards that trigger different rules and actions, built with a reactive UI and centralized game state.",
      "tech": "Technologies I have used",
      "tech_list": "Angular, TypeScript, HTML, CSS, Firebase",
      "team": "What I have learned",
      "team_text": "Developing Ring of Fire strengthened my ability to build interactive applications with clean, event-driven logic. I designed the full game architecture myself, separating UI, gameplay rules and data flow into maintainable modules. Working with Firebase improved my understanding of real-time updates and asynchronous state handling. The project helped me write clearer TypeScript, structure features more predictably and translate complex behavior into stable, scalable code."
    },

    "project4": {
      "title": "Ongoing project",
      "about_text": "Are you currently working on a project? What is it about and what technologies are you using? Emphasise that good planning and execution are essential to the success of your work and to achieving great results.",
      "button": "Let's talk"
    }
  },
  "refs": {
    "headline": "References",
    "headline-mobile": "Need a teamplayer?",
    "text-mobile": "Here what my colleagues said about me",

    "ref1": {
      "text": "„Ebubekir works reliably, structured and brings creative solutions. Working with him was always professional and pleasant.”",
      "author": "Mario Hidri",
      "project": "Project Join"
    },

    "ref2": {
      "text": "„A strong team player who stays calm under pressure. His work was always clean, clear and reliable.”",
      "author": "Alex Herzen",
      "project": "Project Pollo Loco"
    },

    "ref3": {
      "text": "„Ebubekir takes responsibility and delivers results you can rely on. Both technically and personally, he is a real asset.”",
      "author": "Noah Mueller",
      "project": "Project Ring of Fire"
    }
  },
  "contact": {
    "headline": "Contact me",
    "form": {
      "name": "Your name",
      "email": "Your e-mail",
      "message": "Your message",
      "policy_prefix": "I've read the",
      "policy_link": "privacy policy",
      "policy_suffix": "and agree to the processing of my data as outlined.",
      "send": "Send",
      "success": "Thanks! Your message has been sent.",
      "error": "Something went wrong. Please try again later."
    },
    "errors": {
      "name_required": "Please enter your name.",
      "name_minlength": "Please enter at least 5 characters.",
      "name_pattern": "Only letters (a–z), umlauts, spaces, hyphen and apostrophe are allowed.",
      "email_required": "Please enter your email address.",
      "email_pattern": "Please enter a valid email address (e.g. name@example.com).",
      "message_required": "Please enter a message.",
      "message_minchars": "Please enter at least 20 characters.",
      "privacy_required": "Please accept the privacy policy."
    },
    "info": {
      "lead": "Let us work together.",
      "muted": "I am happy to receive any message from people who would like to collaborate with a dedicated developer. I am particularly interested in a full-stack role where I can contribute my knowledge and continue to grow at the same time. Through my enthusiasm for technology, my willingness to learn and my commitment to clean solutions, I am confident that I can be a valuable part of a team. If my work appeals to you, feel free to contact me, i look forward to hearing from you."
    },
    "footer": {
      "legal": "Legal notice",
      "policy": "Privacy policy"
    }
  },
  "about": {
    "subtitle": "Full-Stack Developer"
  },
  "privacy": {
    "title": "Privacy Policy",

    "preamble_heading": "Preamble",
    "preamble_p1": "With this privacy policy, we would like to inform you about which types of your personal data (hereinafter also referred to as “data”) we process, for which purposes and to what extent. This privacy policy applies to all processing of personal data carried out by us, in particular on our website, in mobile applications and within external online presences such as our social media profiles (collectively referred to as the “online offer”).",
    "preamble_p2": "All terms used are to be understood as gender-neutral.",
    "preamble_status": "Last updated: 7 December 2025",

    "overview_heading": "Overview of Processing Activities",
    "overview_intro": "The following overview summarises the categories of data we process, the purposes of processing and the categories of data subjects.",
    "overview_types_heading": "Types of data processed",
    "overview_types_1": "Inventory data.",
    "overview_types_2": "Employee data.",
    "overview_types_3": "Contact data.",
    "overview_types_4": "Content data.",
    "overview_types_5": "Usage data.",
    "overview_types_6": "Meta, communication and procedural data.",

    "overview_subjects_heading": "Categories of data subjects",
    "overview_subjects_1": "Employees.",
    "overview_subjects_2": "Communication partners.",
    "overview_subjects_3": "Users.",
    "overview_subjects_4": "Third parties.",
    "overview_subjects_5": "Whistleblowers.",

    "overview_purposes_heading": "Purposes of processing",
    "overview_purposes_1": "Communication.",
    "overview_purposes_2": "Organisational and administrative purposes.",
    "overview_purposes_3": "Feedback.",
    "overview_purposes_4": "Provision and optimisation of our online offer and user experience.",
    "overview_purposes_5": "Whistleblower protection.",
    "overview_purposes_6": "Public relations.",

    "controller_heading": "Controller",
    "controller_name": "Ebubekir Elicora",
    "controller_street": "Kolberger Str. 4",
    "controller_city": "44649 Herne",
    "controller_email_label": "Email address:",
    "controller_email": "ebubekir.elicora@gmx.de",

    "legal_basis_heading": "Relevant legal bases",
    "legal_basis_intro": "Below you will find an overview of the legal bases of the GDPR on which we process personal data. Please note that, in addition to the provisions of the GDPR, national data protection regulations may apply in your or our country of residence or domicile.",
    "legal_basis_1": "Consent (Art. 6(1)(a) GDPR) – The data subject has given consent to the processing of their personal data for one or more specific purposes.",
    "legal_basis_2": "Performance of a contract and pre-contractual enquiries (Art. 6(1)(b) GDPR) – Processing is necessary for the performance of a contract to which the data subject is party or in order to take steps at the request of the data subject prior to entering into a contract.",
    "legal_basis_3": "Legal obligation (Art. 6(1)(c) GDPR) – Processing is necessary for compliance with a legal obligation to which the controller is subject.",
    "legal_basis_4": "Legitimate interests (Art. 6(1)(f) GDPR) – Processing is necessary for the purposes of the legitimate interests pursued by the controller or by a third party, except where such interests are overridden by the interests or fundamental rights and freedoms of the data subject.",
    "legal_basis_national": "In addition to the GDPR, the German Federal Data Protection Act (BDSG) and, where applicable, the data protection acts of the federal states apply. These contain specific provisions, for example on the right of access, deletion, objection, processing of special categories of data and processing for other purposes.",

    "security_heading": "Security measures",
    "security_p1": "We take appropriate technical and organisational measures in accordance with the legal requirements to ensure a level of security appropriate to the risk, taking into account the state of the art, implementation costs and the nature, scope, context and purposes of processing, as well as the varying likelihood and severity of risks to the rights and freedoms of natural persons.",
    "security_p2": "These measures in particular include safeguarding the confidentiality, integrity and availability of data by controlling physical and electronic access to the data, access rights, input, transfer, availability and separation of data. We have also implemented procedures to ensure the exercise of data subject rights, deletion of data and response to data incidents. Furthermore, we take privacy into account in the development or selection of hardware, software and procedures according to the principles of privacy by design and by default.",
    "security_tls": "To protect users' data transmitted via our online services from unauthorised access, we use TLS/SSL encryption technology (HTTPS). You can recognise an encrypted connection by the “https://” in the address bar of your browser.",

    "intl_heading": "International data transfers",
    "intl_p1": "If we transfer data to a country outside the European Union (EU) or the European Economic Area (EEA), or this occurs in the context of using third-party services or disclosing data to other persons or companies, this is always done in accordance with the legal requirements.",
    "intl_p2": "For data transfers to the USA, we primarily rely on the Data Privacy Framework (DPF) and, where necessary, on standard contractual clauses or consent.",
    "intl_p3": "Further information on the Data Privacy Framework can be found at https://www.dataprivacyframework.gov/. Information on international data transfers and adequacy decisions can be found on the website of the European Commission.",

    "storage_heading": "Storage and deletion of data",
    "storage_p1": "We delete personal data in accordance with the legal requirements as soon as the consents on which processing is based are revoked or there is no other legal basis for processing. This particularly applies when the original purpose of processing no longer applies or the data is no longer required.",
    "storage_p2": "Data must be retained for a longer period where we are obliged to do so by law (for example, commercial or tax law) or where it is necessary for the assertion, exercise or defence of legal claims.",
    "storage_p3": "Where we provide additional information on storage and deletion periods in this privacy policy, these details apply in particular to the respective processing activities.",

    "rights_heading": "Rights of data subjects",
    "rights_intro": "Under the GDPR, you as a data subject have various rights, in particular under Articles 15 to 21 GDPR:",
    "rights_1": "Right to object: You have the right to object at any time, on grounds relating to your particular situation, to the processing of your personal data which is based on Art. 6(1)(e) or (f) GDPR; this also applies to profiling based on these provisions. Where your personal data are processed for direct marketing purposes, you have the right to object at any time to such processing.",
    "rights_2": "Right to withdraw consent: You have the right to withdraw any consent you have given at any time with effect for the future.",
    "rights_3": "Right of access: You have the right to obtain confirmation as to whether or not personal data concerning you are being processed and, where that is the case, access to this data and further information.",
    "rights_4": "Right to rectification: You have the right to obtain the rectification of inaccurate data concerning you and to have incomplete data completed.",
    "rights_5": "Right to erasure and restriction of processing: You have the right to obtain the erasure of data concerning you or, alternatively, the restriction of processing in accordance with the legal requirements.",
    "rights_6": "Right to data portability: You have the right to receive the data concerning you which you have provided to us in a structured, commonly used and machine-readable format or to have those data transmitted to another controller.",
    "rights_7": "Right to lodge a complaint: You have the right to lodge a complaint with a competent data protection supervisory authority if you consider that the processing of personal data relating to you infringes the GDPR.",

    "contact_heading": "Contact and enquiry management",
    "contact_p1": "When you contact us (for example by post, contact form, email, telephone or via social media) and in the context of existing user or business relationships, we process the information you provide insofar as this is necessary to respond to the enquiry and any requested measures.",
    "contact_p2": "The categories of data processed may include in particular inventory data, contact data, content data, usage data as well as meta, communication and procedural data.",
    "contact_p3": "Processing takes place for communication purposes, handling enquiries, organisational and administrative purposes and to provide and improve our online offer. The legal bases are Art. 6(1)(b) GDPR (performance of a contract and pre-contractual measures) and Art. 6(1)(f) GDPR (legitimate interests).",

    "social_heading": "Presence in social networks (social media)",
    "social_p1": "We maintain online presences within social networks and process user data in this context in order to communicate with users active there or to provide information about us.",
    "social_p2": "User data may be processed outside the European Union, which may entail risks for users (for example, difficulties in enforcing data subject rights).",
    "social_p3": "User data in social networks is generally processed for market research and advertising purposes. Usage profiles can be created from the usage behaviour and the resulting interests of users in order to display interest-based advertising inside and outside the networks.",
    "social_p4": "For details on the respective processing operations and the options to object (opt-out) as well as your rights, please refer to the privacy policies and information provided by the respective network operators.",

    "whistle_heading": "Privacy information for whistleblowers",
    "whistle_p1": "If we receive reports of potential misconduct via appropriate reporting channels, we process the personal data provided in this context solely for the purpose of receiving, examining and handling the respective report.",
    "whistle_p2": "Depending on the content of the report, special categories of personal data may also be affected. Processing is based on legal obligations, our legitimate interests in clarifying and pursuing legal violations and, where applicable, on consent.",

    "changes_heading": "Changes and updates",
    "changes_p1": "We kindly ask you to check the content of this privacy policy on a regular basis. We will amend this privacy policy as soon as changes to the data processing carried out by us or changes in the legal situation make this necessary.",
    "changes_p2": "If your cooperation (for example consent) or individual notification becomes necessary as a result of the changes, we will inform you separately.",

    "definitions_heading": "Definitions",
    "definitions_intro": "In this section you will find explanations of some of the terms used in this privacy policy. Where terms are defined by law, the legal definitions apply; the following explanations are intended to aid understanding:",
    "definitions_1": "Personal data: Any information relating to an identified or identifiable natural person.",
    "definitions_2": "Processing: Any operation performed on personal data, such as collection, recording, organisation, storage, adaptation, analysis, transmission or erasure.",
    "definitions_3": "Controller: The natural or legal person, public authority, agency or other body which determines the purposes and means of the processing of personal data.",
    "definitions_4": "Data subject: The identified or identifiable natural person whose personal data are processed.",
    "definitions_5": "Usage data: Data indicating how people use online services, for example pages visited, dwell time or interactions.",
    "definitions_6": "Meta, communication and procedural data: Data arising in the course of administrative and technical processes, such as IP addresses, timestamps or system logs.",

    "seal_text": "Created with the free Datenschutz-Generator.de by Dr. Thomas Schwenke (German original version applies).",
    "seal_link": "https://datenschutz-generator.de/"
  }
}
